#pragma once

enum en_PROTOCOL_TYPE
{
	
	////////////////////////////////////////////////////////
	//
	//	Client & Server Protocol
	//
	////////////////////////////////////////////////////////
	en_PACKET_REQ_SALE = 1,
	//------------------------------------------------------------
	// Client → Server 판매 등록 요청
	//
	//	{
	//		SHORT	Type
	//
	//		WCHAR NickName[10] // 판매 닉네임
	//		INT8 Time // 경매등록시간(h) (24 or 48)
	//		INT32 Price // 최소입찰가	
	//	}
	//
	//------------------------------------------------------------

	en_PACKET_RES_SALE = 2,
	//------------------------------------------------------------
	// Server → Client 판매 등록 결과
	//
	//	{
	//		SHORT	Type
	//
	//		INT8 flag // 0 : 성공, 1 : 실패(이미 판매된적 있는 닉네임), 2 : 서버의 경매 슬롯 부족,  3 : 개인별 판매 슬롯 부족,
	// 
	//	}
	//
	//------------------------------------------------------------

	en_PACKET_REQ_SEARCH = 3,
	//------------------------------------------------------------
	// Client → Server 닉네임 검색 요청
	//
	//	{
	//		SHORT	Type
	//
	//		WCHAR NickName[10] // 판매 닉네임
	//	}
	//
	//------------------------------------------------------------


	en_PACKET_RES_SEARCH = 4,
	//------------------------------------------------------------
	// Server → Client 닉네임 검색 결과
	//
	//	{
	//		SHORT	Type
	//	
	//		WCHAR NickName[10] // 판매중 닉네임
	//		INT8 ItsMine // 경매 권한 (0 : 내 경매, 1 : 타인의 경매)
	//		INT8 Bidder // (0 : 내가 입찰, 1 : 타인이 입찰)
	//		INT8 Status // 상태 // 0 : 경매중, 1 : 마감임박, 2 : 판매완료, 3 : 유찰 
	//		INT32 Price // 최고 입찰가
	//		INT64 EndTime // 마감시간 (마감시간이 넘었다면 종료임박)
	//	
	//	}
	//
	//------------------------------------------------------------

	en_PACKET_REQ_BID = 5,
	//------------------------------------------------------------
	// Client → Server 입찰 요청
	//
	//	{
	//		SHORT	Type
	//
	//		WCHAR NickName[10] // 판매 닉네임
	//		INT32 Price // 입찰 금액
	// 
	//	}
	//
	//------------------------------------------------------------



	en_PACKET_RES_BID = 6,
	//------------------------------------------------------------
	// Server → Client 입찰 응답
	//
	//	{
	//		SHORT	Type
	//
	//		WCHAR NickName[10] // 판매 닉네임
	//		INT8 Bidder // 내 입찰인지 (0 : 내 입찰, 1 : 타인의 입찰)
	//		INT32 Price // 입찰 금액
	//	}
	//
	//------------------------------------------------------------


	en_PACKET_RES_EXPIRE = 7,
	//------------------------------------------------------------
	// Server → Client 경매 만료
	//
	//	{
	//		SHORT	Type
	//
	//		WCHAR NickName[10] // 판매 닉네임
	//		INT8 Status // 1 : 판매완료, 2 : 유찰
	// 
	//	}
	//
	//------------------------------------------------------------



	en_PACKET_REQ_CHANGE_NICKNAME = 8,
	//------------------------------------------------------------
	// Client → Server 닉네임 변경 요청
	//
	//	{
	//		SHORT	Type
	//
	//		WCHAR NickName[10] // 변경 요청 닉네임
	//		
	// 
	//	}
	//
	//------------------------------------------------------------

	en_PACKET_RES_CHANGE_NICKNAME = 9,
	//------------------------------------------------------------
	// Server → Client 닉네임 변경 응답
	//
	//	{
	//		SHORT	Type
	//
	//		INT8 Status // 상태 (0 : 성공, 1 : 실패)
	// 
	//	}
	//
	//------------------------------------------------------------

	en_PACKET_RES_PLAYER_INFO = 10,
	//------------------------------------------------------------
	// Server → Server 접속한 유저 정보 전달
	//
	//	{
	//		SHORT	Type
	//
	//		INT64 AccountNo //회원번호
	//		INT32 Point //닉네임 거래에 사용되는 재화
	//		WCHAR NickName[10] // 현재 접속한 캐릭터 닉네임
	//	}
	//
	//------------------------------------------------------------
};

